doc/CODD.org
#+TITLE: C++DDOopt : The CODD Solver 
#+SETUPFILE: setup.config
#+PROPERTY: header-args :dir ~/Sync/org/tmp  :results drawer :wrap example :exports both
#+INCLUDE: code.inc

* Introduction
** What is *CODD*?
*CODD* is a system for modeling and solving combinatorial optimization problems using decision diagram technology. Problems are represented as state-based dynamic programming models using the CODD language specification.  The model specification is used to automatically compile relaxed and restricted decision diagrams, as well as to guide the search process. *CODD* introduces abstractions that allow to generically implement the solver components while maintaining overall execution efficiency.  We demonstrate the functionality of *CODD* on a variety of combinatorial optimization problems and compare its performance to other state-based solvers as well as integer programming and constraint programming solvers.

We consider discrete optimization problems of the form

\begin{array}{rl}
P : ~~ \max & f(y)\\
\textrm{s.t.} & C_j(y), j = 1, \dots, m,\\
& y \in D
\end{array}

where $y=(y_1,\ldots,y_n)$ is a tuple of decision variables, $f$ is a real-valued objective function over $y$ and $C_1,\ldots,C_m$ are constraints over $y$ with $D=D_1 \times \ldots \times D_n$ denoting the  cartesian product of the domains of the variables $y_i$ ($1 \leq i \leq n$).

** Dynamic Programming as a Computational Model
Dynamic programming can be understood as a labeled transition system where sequences of state-based decisions that delivers a sequence of states $(s_1,\ldots,s_{n+1})$.
At each step $i$, a transition $\tau(s_i,x_i) = s_i \stackrel{x_i}{\rightarrow} s_{i+1}$ is labeled by the decision $x_i$. Each such transition induces a cost $c(s_i,x_i)$. The DP formulation then boils down to:
- the definition of the state space ${\cal S}$ with $s_i \in {\cal S}$.
- two distinguished states $s_\top$ and $s_\bot$  in ${\cal S}$ encoding, respectively, the start state for an empty sequence of decision and the sink state for the full problem
- a label generation function $\lambda : {\cal S} \rightarrow {\cal U}$ representing the values one can use to follow a transition out of a state $s \in {\cal S}$.
- The state transition function $\tau : {\cal S} \times {\cal U} \rightarrow {\cal S}$ modeling the decisions effects 
- The transition cost function $c : {\cal S} \times {\cal U} \rightarrow \mathbb{R}$.
  
The Dynamic Program over the state sequence $(s_1,\ldots,s_{n+1})$ and the decision sequence $(x_1,\ldots,x_{n})$ has the following form

\begin{array}{rll}
\max & v(t) & \\
\textrm{ s.t. } & v(s_{i+1}) = \displaystyle \max_{\substack{x_i \in \lambda(s_i)\\\tau(s_i,x_i)=s_{i+1}}} v(s_i) + c(s_i,x_i) & \forall s_i \in {\cal S} \setminus \{t\} \\
 & v(r) = K
\end{array}
#+begin_important
Observe how the valuation function on the root state $r$ is the constant $K$. Also note how the 
constraints $(C_1,\ldots,C_m)$ are captured by the state transition function $\tau$ and the value generator $\lambda(s_i)$ that proposes appropriate values for decision $x_i$ out of state $s_i$.
#+end_important
Clearly $s_\top$'s value is $K$ and $s_{n+1}=s_\bot$, a state satisfying all the constraints and corresponding to the full problem (all decisions were made).
The valuation function $v$ defined by the Bellman equation above accumulates the cost incurred along each
transition and modeled by the cost function $c$.

The path with the globally optimal cost is the global optimum to the original maximization problem $P$. Naturally, there are potentially exponentially many such path. 

*** Exact Decision Diagrams
*CODD* provides (for generality's sake) an /exact/ decision diagram that builds the state of the LTS just described and can therefore produce a globally optimal solution. While it is relatively direct, it requires the construction of an exponentially size structure and is therefore only useful as a proof of concept. Formally, the solution set of the
exact decision diagram induced by $DD_{Exact}(P)$ is identical to the solution set of $P$, namely ${\cal Sol}(DD_{Exact}(P)) = {\cal Sol}(P)$.

*** Restricted Decision Diagrams
*CODD* provides /restricted/ decision diagrams. Those differ from exact diagram by discarding (during their top-down construction) nodes whose presence would lead to overflowing a maximal imposed /width/. Since the approach throws away states, and therefore /paths/ it runs the risk of loosing the optimal solution. Yet, if they yield  paths leading to $s_\bot$, the best of them is a primal bound to the original problem.
Formally, the solution set of the restricted decision diagram is a subset of the solution set of the original problem $P$. Namely,
${\cal Sol}(DD_{Restricted}(P)) \subseteq {\cal Sol}(P)$.

