doc/CODD.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-19 Mon 11:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>C++DDOopt : The CODD Solver</title>
<meta name="author" content="Laurent Michel" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">C++DDOopt : The CODD Solver</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3ec3c33">1. Introduction</a>
<ul>
<li><a href="#org0d8efc4">1.1. What is <b>CODD</b>?</a></li>
<li><a href="#orge51648f">1.2. Dynamic Programming as a Computational Model</a>
<ul>
<li><a href="#org0454217">1.2.1. Exact Decision Diagrams</a></li>
<li><a href="#org3a3ec05">1.2.2. Restricted Decision Diagrams</a></li>
<li><a href="#orgab5b715">1.2.3. Relaxed Decision Diagrams</a></li>
</ul>
</li>
<li><a href="#org2833cd9">1.3. <b>CODD</b> Modeling</a>
<ul>
<li><a href="#orgc706806">1.3.1. TSP Example High Level</a></li>
<li><a href="#orgdf0259b">1.3.2. TSP Example in <b>CODD</b></a></li>
</ul>
</li>
<li><a href="#org0962cc5">1.4. <b>CODD</b> Solving</a></li>
</ul>
</li>
<li><a href="#orgef98ce8">2. Installing CODD</a>
<ul>
<li><a href="#org483e01b">2.1. Download</a></li>
<li><a href="#orgcdba51e">2.2. Compilation</a>
<ul>
<li><a href="#org003185e">2.2.1. Dependencies</a></li>
<li><a href="#org5edca69">2.2.2. C++ Standard</a></li>
<li><a href="#org0c8f8b3">2.2.3. Build system</a></li>
<li><a href="#orge23d76f">2.2.4. Unit tests</a></li>
<li><a href="#orgfd7b0f3">2.2.5. Library</a></li>
</ul>
</li>
<li><a href="#orgee60d9a">2.3. Examples</a></li>
</ul>
</li>
<li><a href="#org1d2344f">3. The Maximum Independent Set Problem (MISP)</a>
<ul>
<li><a href="#orgc9ab23d">3.1. Preamble</a></li>
<li><a href="#org4785a9c">3.2. Reading the instance</a></li>
<li><a href="#orgf4e64b2">3.3. State definition</a></li>
<li><a href="#org69587b7">3.4. Main Model</a>
<ul>
<li><a href="#org9c34c3e">3.4.1. Getting started</a></li>
<li><a href="#orgaa5301e">3.4.2. The Bound Tracker</a></li>
<li><a href="#org73bff9d">3.4.3. Defining neighbors</a></li>
<li><a href="#orgb6066fb">3.4.4. The actual CODD Model</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6476352">4. Papers</a>
<ul>
<li><a href="#org9d1380f">4.1. CODD</a></li>
</ul>
</li>
<li><a href="#org679490b">5. Related Systems</a>
<ul>
<li><a href="#org92841f9">5.1. DDO</a></li>
<li><a href="#org7b5ee8f">5.2. Domain Independent DP</a></li>
<li><a href="#org6a6630c">5.3. Peel &amp; Bound</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org3ec3c33" class="outline-2">
<h2 id="org3ec3c33"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0d8efc4" class="outline-3">
<h3 id="org0d8efc4"><span class="section-number-3">1.1.</span> What is <b>CODD</b>?</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<b>CODD</b> is a system for modeling and solving combinatorial optimization problems using decision diagram technology. Problems are represented as state-based dynamic programming models using the CODD language specification.  The model specification is used to automatically compile relaxed and restricted decision diagrams, as well as to guide the search process. <b>CODD</b> introduces abstractions that allow to generically implement the solver components while maintaining overall execution efficiency.  We demonstrate the functionality of <b>CODD</b> on a variety of combinatorial optimization problems and compare its performance to other state-based solvers as well as integer programming and constraint programming solvers.
</p>

<p>
We consider discrete optimization problems of the form
</p>

\begin{array}{rl}
P : ~~ \max & f(y)\\
\textrm{s.t.} & C_j(y), j = 1, \dots, m,\\
& y \in D
\end{array}

<p>
where \(y=(y_1,\ldots,y_n)\) is a tuple of decision variables, \(f\) is a real-valued objective function over \(y\) and \(C_1,\ldots,C_m\) are constraints over \(y\) with \(D=D_1 \times \ldots \times D_n\) denoting the  cartesian product of the domains of the variables \(y_i\) (\(1 \leq i \leq n\)).
</p>
</div>
</div>
<div id="outline-container-orge51648f" class="outline-3">
<h3 id="orge51648f"><span class="section-number-3">1.2.</span> Dynamic Programming as a Computational Model</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Dynamic programming can be understood as a labeled transition system where sequences of state-based decisions that delivers a sequence of states \((s_1,\ldots,s_{n+1})\).
At each step \(i\), a transition \(\tau(s_i,x_i) = s_i \stackrel{x_i}{\rightarrow} s_{i+1}\) is labeled by the decision \(x_i\). Each such transition induces a cost \(c(s_i,x_i)\). The DP formulation then boils down to:
</p>
<ul class="org-ul">
<li>the definition of the state space \({\cal S}\) with \(s_i \in {\cal S}\).</li>
<li>two distinguished states \(s_\top\) and \(s_\bot\)  in \({\cal S}\) encoding, respectively, the start state for an empty sequence of decision and the sink state for the full problem</li>
<li>a label generation function \(\lambda : {\cal S} \rightarrow {\cal U}\) representing the values one can use to follow a transition out of a state \(s \in {\cal S}\).</li>
<li>The state transition function \(\tau : {\cal S} \times {\cal U} \rightarrow {\cal S}\) modeling the decisions effects</li>
<li>The transition cost function \(c : {\cal S} \times {\cal U} \rightarrow \mathbb{R}\).</li>
</ul>

<p>
The Dynamic Program over the state sequence \((s_1,\ldots,s_{n+1})\) and the decision sequence \((x_1,\ldots,x_{n})\) has the following form
</p>

\begin{array}{rll}
\max & v(t) & \\
\textrm{ s.t. } & v(s_{i+1}) = \displaystyle \max_{\substack{x_i \in \lambda(s_i)\\\tau(s_i,x_i)=s_{i+1}}} v(s_i) + c(s_i,x_i) & \forall s_i \in {\cal S} \setminus \{t\} \\
 & v(r) = K
\end{array}
<div class="important" id="orgd625a5b">
<p>
Observe how the valuation function on the root state \(r\) is the constant \(K\). Also note how the 
constraints \((C_1,\ldots,C_m)\) are captured by the state transition function \(\tau\) and the value generator \(\lambda(s_i)\) that proposes appropriate values for decision \(x_i\) out of state \(s_i\).
</p>

</div>
<p>
Clearly \(s_\top\)'s value is \(K\) and \(s_{n+1}=s_\bot\), a state satisfying all the constraints and corresponding to the full problem (all decisions were made).
The valuation function \(v\) defined by the Bellman equation above accumulates the cost incurred along each
transition and modeled by the cost function \(c\).
</p>

<p>
The path with the globally optimal cost is the global optimum to the original maximization problem \(P\). Naturally, there are potentially exponentially many such path. 
</p>
</div>
<div id="outline-container-org0454217" class="outline-4">
<h4 id="org0454217"><span class="section-number-4">1.2.1.</span> Exact Decision Diagrams</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
<b>CODD</b> provides (for generality's sake) an <i>exact</i> decision diagram that builds the state of the LTS just described and can therefore produce a globally optimal solution. While it is relatively direct, it requires the construction of an exponentially size structure and is therefore only useful as a proof of concept. Formally, the solution set of the
exact decision diagram induced by \(DD_{Exact}(P)\) is identical to the solution set of \(P\), namely \({\cal Sol}(DD_{Exact}(P)) = {\cal Sol}(P)\).
</p>
</div>
</div>
<div id="outline-container-org3a3ec05" class="outline-4">
<h4 id="org3a3ec05"><span class="section-number-4">1.2.2.</span> Restricted Decision Diagrams</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
<b>CODD</b> provides <i>restricted</i> decision diagrams. Those differ from exact diagram by discarding (during their top-down construction) nodes whose presence would lead to overflowing a maximal imposed <i>width</i>. Since the approach throws away states, and therefore <i>paths</i> it runs the risk of loosing the optimal solution. Yet, if they yield  paths leading to \(s_\bot\), the best of them is a primal bound to the original problem.
Formally, the solution set of the restricted decision diagram is a subset of the solution set of the original problem \(P\). Namely,
\({\cal Sol}(DD_{Restricted}(P)) \subseteq {\cal Sol}(P)\).
</p>
</div>
</div>
