doc/CODD.org
*** Relaxed Decision Diagrams
*CODD* provides /relaxed/ decision diagrams. Those differ from exact diagram by /merging/ states whose presence would induce a diagram /width/ exceeding a given bound. The state merge operator must be a legit relaxation in the following sense: it yields a state that no longer satisfies all constraints in $(C_1,\ldots,C_m)$. While the width ensure that the size of the diagram remains under control, it /introduces/ new states that are no longer satisfiable. Path leading to $s_\bot$ going through at least one such unsatisfiable state are no longer modeling a solution of the original problem. Formally, the solution set of the relaxed diagram is now a super set of the solution set of the original problem $P$. Namely,
${\cal Sol}(DD_{Relaxed}(P)) \supseteq {\cal Sol}(P)$.

From the above, one gets to derive primal bounds using the restricted diagrams and dual bounds using the relaxed one.

#+begin_important
Note how all three diagrams are based on the same LTS abstractions of states, labels, transitions, merge and costs and equality to $s_\bot$. These abstractions are the core
modeling facilities offered by *CODD*. 
#+end_important

** *CODD* Modeling
Unsurprisingly, the abstractions presented above match exactly with the *CODD* API that expects:
- A structure to define a state
- Two distinguished states $s_\top$ and $s_\bot$ used to represent a state with no decisions made ($s_\top$) and all possible decision made ($s_\bot$).
- A label generation function $\lambda$ which given a state $s_i$, produces the set of potentially viable transitions
- A state transition function $\tau$ which, given a state $s_i$ and a potentially viable label $\ell$, produces either nothing ($\bot$) or a new state $s_{i+1}$ such that
  $s_i \stackrel{x_i=\ell}{\longrightarrow} s_{i+1} \in \tau$.
- A cost function $c$ which, given a state $s_i$ and a viable label $\ell$ produces the cost of the transition $s_i \stackrel{x_i=\ell}{\longrightarrow} s_{i+1}$
- An /optional/ equality to $s_\bot$ function that returns true whenever its input state /is/ $s_\bot$.

#+begin_note
An /optional/ local dual bounding function which, given a state $s_i$ compute a coarse dual bound for completing $s_i$. /this optional abstraction/ is helpful to quickly assess whether a state has any hope of leading to an improving $s_\bot$. If a state does not, it can be discarded from the relaxation.
#+end_note
Thankfully, C++ is a rich language supporting polymorphic types, first order and higher order functions. Those provide the basis to naturally convey the formal abstractions given above. The /state/ become a /type/ in C++ and all the other abstractions becomes first-order functions (lambdas in C++ parlance).

*** TSP Example High Level
Consider the task of solving instances of the traveling salesman problem. With the abstraction defined above, to express a TSP over a set of cities $V=\{1..n\}$ we define:

- Let a state $s \in {\cal S}$ be a triplet $\langle S,e,h\rangle$ with $S \subseteq V$ the set of cities visited thus far, $e$ the name of the city last visited (or 0 at the start), and $h$ the number of hops made thus far (or 0 at the start).
- Let $s_\top = \langle \{1\},1,0\rangle$ since no cities have been visited, hence last city is the
  depot 1 and the salesman did not do any "hops". 
- Let $s_\bot = \langle V,1,n\rangle$. Indeed, without loss of generality, we will start from the depot 1 and thus /return/ to the depot 1 (which will thus be the last visited). The trip will have carried out $n$ hops and visited all cities in $V$.
- The label generator is a function $\lambda : {\cal S} \rightarrow {\cal U}$ defined as

  \begin{array}{lccl}
    \lambda(\langle S,e,h\rangle)  &=& V \setminus S & \Leftrightarrow h < n-1,\\ 
     &=&\{1\} & \Leftrightarrow h=n-1
  \end{array}
  
- The state transition function $\tau : {\cal S} \times {\cal L} \rightarrow {\cal S}$ is
\begin{array}{lcll}
\tau(\langle S,e,h \rangle,\ell) &=& \langle V,\ell,n\rangle  & \Leftrightarrow \ell=1  \\
&& \langle S \cup \{\ell\},\ell,h+1\rangle & \Leftrightarrow \mbox{otherwise} 
\end{array}
The condition $\ell=1$  indicates a return to the depot (1).
The alternative extends the set of visited cities with $\ell$ and adds one hop. Naturally, the cost
function is straightforwardly defined as $c(\langle S,e,h\rangle,\ell) = d_{e,\ell}$ while the merge operator $\oplus(\langle S_1,e_1,h_1\rangle,\langle S_2,e_2,h_2\rangle) = \langle S_1 \cup S_2,e_1,h_1\rangle$ provided that $e_1=e_2 \wedge h_1=h_2$.

