doc/CODD.org
*** TSP Example in *CODD*
Modeling with *CODD* first requires a type to represent a state. Since a state is a triplet, the model uses a =C= structure.

#+begin_src c++
struct TSP {
   GNSet  s;
   int last;
   int hops;
   friend std::ostream& operator<<(std::ostream& os,const TSP& m) {
      return os << "<" << m.s << ',' << m.last << ',' << m.hops << ">";
   }
};
#+end_src
Note the additional (and optional) output operator used to inspect state.
In addition to the state, *CODD* expects 2 standard operations on state. Equality testing and hashing. Namely, 
#+begin_src c++
template<> struct std::equal_to<TSP> {
   constexpr bool operator()(const TSP& s1,const TSP& s2) const {
      return s1.last == s2.last && s1.hops==s2.hops && s1.s == s2.s;
   }
};
#+end_src
Is a STL compliant implementation of equality testing for a type =T= which, here, is none other than the =TSP= structure.
Likewise, the STL compliant fragment
#+begin_src c++
template<> struct std::hash<TSP> {
   std::size_t operator()(const TSP& v) const noexcept {
      return (std::hash<GNSet>{}(v.s) << 24) |
         (std::hash<int>{}(v.last) << 16) |
         std::hash<int>{}(v.hops);
   }
};
#+end_src
defines a =hash= operator for the state type =TSP=.  Both state equality and state hashing are used internally by *CODD*.
Given $V$ a constant set holding the set of cities and $n$ its size, 
it is now easy to define both $s_\top$ and $s_\bot$ with:
#+begin_src c++
  const auto init = []() {   // The root state
     return TSP { GNSet{1},1,0 };
  };
  const auto target = [&V,n]() {    // The sink state
     return TSP { V,1,n };
  };
#+end_src
Note how the =init= and the =target= closures can be called to manufacture the desired states.
The label generation function is also defined with a simple closure
#+begin_src c++
  const auto lgf = [&V,n](const TSP& s)  {
     if (s.hops == n - 1)
        return GNSet {1};
     else 
        return V - s.s;
  };
#+end_src
The body of the closure uses the capture set of cities =V=
and returns a singleton with just the depot city (1) if this is the last hop or $V \setminus s.s$ otherwise.

The function $\tau$ is, unsurprisingly, another closure (which captures =n= and =V= denoting, respectively, the number of cities and the set of all cities.)
#+begin_src c++
  const auto stf = [&V,n](const TSP& s,const int label) -> std::optional<TSP> {
      if (label==1)
         return TSP { V,1,n};
      else 
         return TSP { s.s | GNSet{label},label,s.hops + 1};     
  };
#+end_src
The case analysis carried out in the code mirrors exactly the formal definition. If the value $label$ indicates a return  to the depot, we return the sink state. Otherwise, we add $label$ to the set of visited cities $s.s$, set the last visited city as $label$ and increase the number of hops by 1.

The cost of a transition is also modeled with a closure that captures the distance matrix $d$ and reads:
#+begin_src c++
  const auto scf = [&d](const TSP& s,int label) { // partial cost function 
     return d[s.e][label];
  };
#+end_src
The state merge $\oplus$ is simply:
#+begin_src c++
  const auto smf = [](const TSP& s1,const TSP& s2) -> std::optional<TSP> {
     if (s1.last == s2.last && s1.hops == s2.hops) 
        return TSP {s1.s & s2.s , s1.last, s1.hops};
     else return std::nullopt; // return  the empty optional
  };
#+end_src
Observe how this closure takes two states $s_1$ and $s_2$ and considers them
mergeable if they both end in the same city and have the same number of hops. The relaxation stems from the fact that the set /intersection/ between $s_1.s$ and $s_2.s$ will only retain cities that were visited in both.

Finally, the equality to the sink (target) state is also closure:
#+begin_src c++
  const auto eqs = [n](const TSP& s) -> bool {
     return s.last == 1 && s.hops == n;
  };  
#+end_src
Which deems state $s$ equal to the sink if the last city is 1 and we have the desired number of hops $sz$. 
 
