doc/CODD.html
<div id="outline-container-orgdf0259b" class="outline-4">
<h4 id="orgdf0259b"><span class="section-number-4">1.3.2.</span> TSP Example in <b>CODD</b></h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Modeling with <b>CODD</b> first requires a type to represent a state. Since a state is a triplet, the model uses a <code>C</code> structure.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #0000FF; font-weight: bold;">struct</span> <span style="color: #6434A3;">TSP</span> {
   <span style="color: #6434A3;">GNSet</span>  <span style="color: #BA36A5;">s</span>;
   <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">last</span>;
   <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">hops</span>;
   <span style="color: #0000FF; font-weight: bold;">friend</span> <span style="color: #D0372D;">std</span>::<span style="color: #6434A3;">ostream</span>&amp; <span style="color: #0000FF; font-weight: bold;">operator</span><span style="color: #006699;">&lt;&lt;</span>(<span style="color: #D0372D;">std</span>::<span style="color: #6434A3;">ostream</span>&amp; <span style="color: #BA36A5;">os</span>,<span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #6434A3;">TSP</span>&amp; <span style="color: #BA36A5;">m</span>) {
      <span style="color: #0000FF; font-weight: bold;">return</span> os &lt;&lt; <span style="color: #008000;">"&lt;"</span> &lt;&lt; m.s &lt;&lt; <span style="color: #008000;">','</span> &lt;&lt; m.last &lt;&lt; <span style="color: #008000;">','</span> &lt;&lt; m.hops &lt;&lt; <span style="color: #008000;">"&gt;"</span>;
   }
};
</pre>
</div>
<p>
Note the additional (and optional) output operator used to inspect state.
In addition to the state, <b>CODD</b> expects 2 standard operations on state. Equality testing and hashing. Namely, 
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #0000FF; font-weight: bold;">template</span>&lt;&gt; <span style="color: #0000FF; font-weight: bold;">struct</span> <span style="color: #D0372D;">std</span>::<span style="color: #6434A3;">equal_to</span>&lt;TSP&gt; {
   <span style="color: #0000FF; font-weight: bold;">constexpr</span> <span style="color: #6434A3;">bool</span> <span style="color: #0000FF; font-weight: bold;">operator</span><span style="color: #006699;">()</span>(<span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #6434A3;">TSP</span>&amp; <span style="color: #BA36A5;">s1</span>,<span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #6434A3;">TSP</span>&amp; <span style="color: #BA36A5;">s2</span>) <span style="color: #0000FF; font-weight: bold;">const</span> {
      <span style="color: #0000FF; font-weight: bold;">return</span> s1.last == s2.last &amp;&amp; s1.hops==s2.hops &amp;&amp; s1.s == s2.s;
   }
};
</pre>
</div>
<p>
Is a STL compliant implementation of equality testing for a type <code>T</code> which, here, is none other than the <code>TSP</code> structure.
Likewise, the STL compliant fragment
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #0000FF; font-weight: bold;">template</span>&lt;&gt; <span style="color: #0000FF; font-weight: bold;">struct</span> <span style="color: #D0372D;">std</span>::<span style="color: #6434A3;">hash</span>&lt;TSP&gt; {
   <span style="color: #D0372D;">std</span>::<span style="color: #6434A3;">size_t</span> <span style="color: #0000FF; font-weight: bold;">operator</span><span style="color: #006699;">()</span>(<span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #6434A3;">TSP</span>&amp; <span style="color: #BA36A5;">v</span>) <span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #0000FF; font-weight: bold;">noexcept</span> {
      <span style="color: #0000FF; font-weight: bold;">return</span> (<span style="color: #D0372D;">std</span>::<span style="color: #6434A3;">hash</span>&lt;GNSet&gt;{}(v.s) &lt;&lt; 24) |
         (<span style="color: #D0372D;">std</span>::<span style="color: #6434A3;">hash</span>&lt;<span style="color: #6434A3;">int</span>&gt;{}(v.last) &lt;&lt; 16) |
         <span style="color: #D0372D;">std</span>::<span style="color: #6434A3;">hash</span>&lt;<span style="color: #6434A3;">int</span>&gt;{}(v.hops);
   }
};
</pre>
</div>
<p>
defines a <code>hash</code> operator for the state type <code>TSP</code>.  Both state equality and state hashing are used internally by <b>CODD</b>.
Given \(V\) a constant set holding the set of cities and \(n\) its size, 
it is now easy to define both \(s_\top\) and \(s_\bot\) with:
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #0000FF; font-weight: bold;">auto</span> <span style="color: #BA36A5;">init</span> = []() {   <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">The root state</span>
   <span style="color: #0000FF; font-weight: bold;">return</span> TSP { GNSet{1},1,0 };
};
<span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #0000FF; font-weight: bold;">auto</span> <span style="color: #BA36A5;">target</span> = [&amp;<span style="color: #BA36A5;">V</span>,<span style="color: #D0372D;">n</span>]() {    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">The sink state</span>
   <span style="color: #0000FF; font-weight: bold;">return</span> TSP { V,1,n };
};
</pre>
</div>
<p>
Note how the <code>init</code> and the <code>target</code> closures can be called to manufacture the desired states.
The label generation function is also defined with a simple closure
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #0000FF; font-weight: bold;">auto</span> <span style="color: #BA36A5;">lgf</span> = [&amp;<span style="color: #BA36A5;">V</span>,<span style="color: #D0372D;">n</span>](<span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #6434A3;">TSP</span>&amp; <span style="color: #BA36A5;">s</span>)  {
   <span style="color: #0000FF; font-weight: bold;">if</span> (s.hops == n - 1)
      <span style="color: #0000FF; font-weight: bold;">return</span> GNSet {1};
   <span style="color: #0000FF; font-weight: bold;">else</span> 
      <span style="color: #0000FF; font-weight: bold;">return</span> V - s.s;
};
</pre>
</div>
<p>
The body of the closure uses the capture set of cities <code>V</code>
and returns a singleton with just the depot city (1) if this is the last hop or \(V \setminus s.s\) otherwise.
</p>

<p>
The function \(\tau\) is, unsurprisingly, another closure (which captures <code>n</code> and <code>V</code> denoting, respectively, the number of cities and the set of all cities.)
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #0000FF; font-weight: bold;">auto</span> <span style="color: #BA36A5;">stf</span> = [&amp;<span style="color: #BA36A5;">V</span>,<span style="color: #D0372D;">n</span>](<span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #6434A3;">TSP</span>&amp; <span style="color: #BA36A5;">s</span>,<span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">label</span>) -&gt; <span style="color: #D0372D;">std</span>::<span style="color: #6434A3;">optional</span>&lt;<span style="color: #6434A3;">TSP</span>&gt; {
    <span style="color: #0000FF; font-weight: bold;">if</span> (label==1)
       <span style="color: #0000FF; font-weight: bold;">return</span> TSP { V,1,n};
    <span style="color: #0000FF; font-weight: bold;">else</span> 
       <span style="color: #0000FF; font-weight: bold;">return</span> TSP { s.s | GNSet{label},label,s.hops + 1};     
};
</pre>
</div>
<p>
The case analysis carried out in the code mirrors exactly the formal definition. If the value \(label\) indicates a return  to the depot, we return the sink state. Otherwise, we add \(label\) to the set of visited cities \(s.s\), set the last visited city as \(label\) and increase the number of hops by 1.
</p>

<p>
The cost of a transition is also modeled with a closure that captures the distance matrix \(d\) and reads:
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #0000FF; font-weight: bold;">auto</span> <span style="color: #BA36A5;">scf</span> = [&amp;<span style="color: #BA36A5;">d</span>](<span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #6434A3;">TSP</span>&amp; <span style="color: #BA36A5;">s</span>,<span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">label</span>) { <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">partial cost function </span>
   <span style="color: #0000FF; font-weight: bold;">return</span> d[s.e][label];
};
</pre>
</div>
<p>
The state merge \(\oplus\) is simply:
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #0000FF; font-weight: bold;">auto</span> <span style="color: #BA36A5;">smf</span> = [](<span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #6434A3;">TSP</span>&amp; <span style="color: #BA36A5;">s1</span>,<span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #6434A3;">TSP</span>&amp; <span style="color: #BA36A5;">s2</span>) -&gt; <span style="color: #D0372D;">std</span>::<span style="color: #6434A3;">optional</span>&lt;<span style="color: #6434A3;">TSP</span>&gt; {
   <span style="color: #0000FF; font-weight: bold;">if</span> (s1.last == s2.last &amp;&amp; s1.hops == s2.hops) 
      <span style="color: #0000FF; font-weight: bold;">return</span> TSP {s1.s &amp; s2.s , s1.last, s1.hops};
   <span style="color: #0000FF; font-weight: bold;">else</span> <span style="color: #0000FF; font-weight: bold;">return</span> <span style="color: #D0372D;">std</span>::nullopt; <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">return  the empty optional</span>
};
</pre>
</div>
<p>
Observe how this closure takes two states \(s_1\) and \(s_2\) and considers them
mergeable if they both end in the same city and have the same number of hops. The relaxation stems from the fact that the set <i>intersection</i> between \(s_1.s\) and \(s_2.s\) will only retain cities that were visited in both.
</p>

<p>
Finally, the equality to the sink (target) state is also closure:
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #0000FF; font-weight: bold;">auto</span> <span style="color: #BA36A5;">eqs</span> = [<span style="color: #D0372D;">n</span>](<span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #6434A3;">TSP</span>&amp; <span style="color: #BA36A5;">s</span>) -&gt; <span style="color: #6434A3;">bool</span> {
   <span style="color: #0000FF; font-weight: bold;">return</span> s.last == 1 &amp;&amp; s.hops == n;
};  
</pre>
</div>
<p>
Which deems state \(s\) equal to the sink if the last city is 1 and we have the desired number of hops \(sz\). 
</p>
</div>
</div>
</div>
