doc/CODD.org
** *CODD* Solving
Solving the TSP then reduces to /instantiating/ the generic solver with all the closures defined earlier. Namely:
#+begin_src c++
   BAndB engine(DD<TSP,Minimize<double>, // to minimize
                decltype(target),
                decltype(lgf),
                decltype(stf),
                decltype(scf),
                decltype(smf),
                decltype(eqs)
                >::makeDD(init,target,lgf,stf,scf,smf,eqs,labels),1);
   engine.search(bnds);
#+end_src
Note how the =DD= template is specialized with the state type =TSP=, the type
=Minimize<double>= to convey that this is a minimization, and the types of the various
closures using the C++-23 =decltype= operator. The solver is invoked with the last line.
#+begin_important
*CODD* users never directly call any of those closures. Calls to the closures are
choreographed by the solver to build the diagrams and reason with them. *CODD* users are strictly focused on defining the DP LTS in a mathematical sense and then doing the 1-1 translation to C++. 
#+end_important

* Installing CODD
** Download
The CODD solver is available on [[https://github.com/ldmbouge/CPPddOpt][github]]. 
** Compilation
The CODD C++ library implements both the modeling and the solving framework. It extensively
relies on functional closures to deliver concise, declarative and elegant models.
It has:
- Restricted / exact / relax diagrams
- State definition, initial, terminal, tranistion and state merging functions separated
- Label generation functions 
- Equivalence predicate for sink.
It allows to define model to solve problems using a dynamic programming style with the
support of underlying decision diagrams.

*** Dependencies
You need ~graphviz~ (The ~dot~ binary) to create graph images. It happens
automatically when the ~display~ method is called. Temporary files are created
in ~/tmp~ and the macOS ~open~ command is used (via ~fork/execlp~)  to open the generated PDF. The rest of the system is vanilla C++-23 and =cmake=.
#+begin_hint
Keep in mind that this is optional and only needed if you wish to generate images of
diagrams (typically to debug models).
#+end_hint
*** C++ Standard
You need a C++-23 capable compiler. gcc and clang should both work. I work on macOS where I use the mainline clang coming with Xcode. The implementation uses templates and concepts to factor the code.
*** Build system
This is ~cmake~. Simply do the following
#+begin_src bash :exports source
  mkdir build
  cd build
  cmake ..
  make -j4
#+end_src
And it will compile the whole thing. To compile in optimized mode, simply change
the variable ~CMAKE_BUILD_TYPE~ from ~Debug~ to ~Release~ as shown below:
#+begin_src bash :exports source
  cmake .. -DCMAKE_BUILD_TYPE=Release
#+end_src
*** Unit tests
In the ~test~ folder. Mostly for the low-level containers.
*** Library
All of it in the ~src~ folder.
#+begin_src shell :dir . :exports both
  scc  -i cpp,org,h,hpp ..
#+end_src

#+RESULTS:
#+begin_example
───────────────────────────────────────────────────────────────────────────────
Language                 Files     Lines   Blanks  Comments     Code Complexity
───────────────────────────────────────────────────────────────────────────────
C++                         29      4288      298       274     3716        670
C++ Header                  15      3098      132       338     2628        431
JSON                         3        70        1         0       69          0
Org                          3       771       97         0      674        100
Markdown                     2       167       74         0       93          0
CMake                        1        81       14        13       54          1
HTML                         1      1101       80         1     1020          0
gitignore                    1         4        0         0        4          0
───────────────────────────────────────────────────────────────────────────────
Total                       55      9580      696       626     8258       1202
───────────────────────────────────────────────────────────────────────────────
Estimated Cost to Develop (organic) $247,921
Estimated Schedule Effort (organic) 8.10 months
Estimated People Required (organic) 2.72
───────────────────────────────────────────────────────────────────────────────
Processed 350792 bytes, 0.351 megabytes (SI)
───────────────────────────────────────────────────────────────────────────────

#+end_example


** Examples
To be found in the ~examples~ folder
- ~coloringtoy~ tiny coloring bench (same as in python)
- ~foo~ maximum independent set (toy size)
- ~tstpoy~ tiny TSP instance (same as in python)
- ~gruler~ golomb ruler (usage <size> <ubOnLabels>)
- ~misp~ the maximum independent set problem
* The Maximum Independent Set Problem (MISP)
It is, perhaps, most effective to look at some models
to get a reasonable sense of the effort it takes to model and
solve a problem with *CODD*. 
** Preamble
To start using CODD, it is sufficent to include its main header as follow
#+name: preamble
#+begin_src c++
#include "codd.hpp"
#+end_src

