doc/CODD.html
<div id="outline-container-org0962cc5" class="outline-3">
<h3 id="org0962cc5"><span class="section-number-3">1.4.</span> <b>CODD</b> Solving</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Solving the TSP then reduces to <i>instantiating</i> the generic solver with all the closures defined earlier. Namely:
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #6434A3;">BAndB</span> <span style="color: #BA36A5;">engine</span>(<span style="color: #D0372D;">DD</span>&lt;TSP,<span style="color: #6434A3;">Minimize</span>&lt;<span style="color: #6434A3;">double</span>&gt;, <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">to minimize</span>
             <span style="color: #0000FF; font-weight: bold;">decltype</span>(target),
             <span style="color: #0000FF; font-weight: bold;">decltype</span>(lgf),
             <span style="color: #0000FF; font-weight: bold;">decltype</span>(stf),
             <span style="color: #0000FF; font-weight: bold;">decltype</span>(scf),
             <span style="color: #0000FF; font-weight: bold;">decltype</span>(smf),
             <span style="color: #0000FF; font-weight: bold;">decltype</span>(eqs)
             &gt;::makeDD(init,target,lgf,stf,scf,smf,eqs,labels),1);
engine.search(bnds);
</pre>
</div>
<p>
Note how the <code>DD</code> template is specialized with the state type <code>TSP</code>, the type
<code>Minimize&lt;double&gt;</code> to convey that this is a minimization, and the types of the various
closures using the C++-23 <code>decltype</code> operator. The solver is invoked with the last line.
</p>
<div class="important" id="org1a845cb">
<p>
<b>CODD</b> users never directly call any of those closures. Calls to the closures are
choreographed by the solver to build the diagrams and reason with them. <b>CODD</b> users are strictly focused on defining the DP LTS in a mathematical sense and then doing the 1-1 translation to C++. 
</p>

</div>
</div>
</div>
</div>
<div id="outline-container-orgef98ce8" class="outline-2">
<h2 id="orgef98ce8"><span class="section-number-2">2.</span> Installing CODD</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org483e01b" class="outline-3">
<h3 id="org483e01b"><span class="section-number-3">2.1.</span> Download</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The CODD solver is available on <a href="https://github.com/ldmbouge/CPPddOpt">github</a>. 
</p>
</div>
</div>
<div id="outline-container-orgcdba51e" class="outline-3">
<h3 id="orgcdba51e"><span class="section-number-3">2.2.</span> Compilation</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The CODD C++ library implements both the modeling and the solving framework. It extensively
relies on functional closures to deliver concise, declarative and elegant models.
It has:
</p>
<ul class="org-ul">
<li>Restricted / exact / relax diagrams</li>
<li>State definition, initial, terminal, tranistion and state merging functions separated</li>
<li>Label generation functions</li>
<li>Equivalence predicate for sink.</li>
</ul>
<p>
It allows to define model to solve problems using a dynamic programming style with the
support of underlying decision diagrams.
</p>
</div>
<div id="outline-container-org003185e" class="outline-4">
<h4 id="org003185e"><span class="section-number-4">2.2.1.</span> Dependencies</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
You need <code>graphviz</code> (The <code>dot</code> binary) to create graph images. It happens
automatically when the <code>display</code> method is called. Temporary files are created
in <code>/tmp</code> and the macOS <code>open</code> command is used (via <code>fork/execlp</code>)  to open the generated PDF. The rest of the system is vanilla C++-23 and <code>cmake</code>.
</p>
<div class="hint" id="org28e4ebd">
<p>
Keep in mind that this is optional and only needed if you wish to generate images of
diagrams (typically to debug models).
</p>

</div>
</div>
</div>
<div id="outline-container-org5edca69" class="outline-4">
<h4 id="org5edca69"><span class="section-number-4">2.2.2.</span> C++ Standard</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
You need a C++-23 capable compiler. gcc and clang should both work. I work on macOS where I use the mainline clang coming with Xcode. The implementation uses templates and concepts to factor the code.
</p>
</div>
</div>
<div id="outline-container-org0c8f8b3" class="outline-4">
<h4 id="org0c8f8b3"><span class="section-number-4">2.2.3.</span> Build system</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
This is <code>cmake</code>. Simply do the following
</p>
<div class="org-src-container">
<pre class="src src-bash">mkdir build
<span style="color: #006FE0;">cd</span> build
cmake ..
make -j4
</pre>
</div>
<p>
And it will compile the whole thing. To compile in optimized mode, simply change
the variable <code>CMAKE_BUILD_TYPE</code> from <code>Debug</code> to <code>Release</code> as shown below:
</p>
<div class="org-src-container">
<pre class="src src-bash">cmake .. -DCMAKE_BUILD_TYPE=Release
</pre>
</div>
</div>
</div>
<div id="outline-container-orge23d76f" class="outline-4">
<h4 id="orge23d76f"><span class="section-number-4">2.2.4.</span> Unit tests</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
In the <code>test</code> folder. Mostly for the low-level containers.
</p>
</div>
</div>
<div id="outline-container-orgfd7b0f3" class="outline-4">
<h4 id="orgfd7b0f3"><span class="section-number-4">2.2.5.</span> Library</h4>
<div class="outline-text-4" id="text-2-2-5">
<p>
All of it in the <code>src</code> folder.
</p>
<div class="org-src-container">
<pre class="src src-shell">scc  -i cpp,org,h,hpp ..
</pre>
</div>

<pre class="example" id="org69c2864">
───────────────────────────────────────────────────────────────────────────────
Language                 Files     Lines   Blanks  Comments     Code Complexity
───────────────────────────────────────────────────────────────────────────────
C++                         33      5068      343       311     4414        812
C++ Header                  16      3330      151       352     2827        451
Org                          3       818      100         0      718         92
───────────────────────────────────────────────────────────────────────────────
Total                       52      9216      594       663     7959       1355
───────────────────────────────────────────────────────────────────────────────
Estimated Cost to Develop (organic) $238,504
Estimated Schedule Effort (organic) 7.98 months
Estimated People Required (organic) 2.66
───────────────────────────────────────────────────────────────────────────────
Processed 303650 bytes, 0.304 megabytes (SI)
───────────────────────────────────────────────────────────────────────────────
</pre>
</div>
</div>
</div>
<div id="outline-container-orgee60d9a" class="outline-3">
<h3 id="orgee60d9a"><span class="section-number-3">2.3.</span> Examples</h3>
<div class="outline-text-3" id="text-2-3">
<p>
To be found in the <code>examples</code> folder
</p>
<ul class="org-ul">
<li><code>coloringtoy</code> tiny coloring bench (same as in python)</li>
<li><code>foo</code> maximum independent set (toy size)</li>
<li><code>tstpoy</code> tiny TSP instance (same as in python)</li>
<li><code>gruler</code> golomb ruler (usage &lt;size&gt; &lt;ubOnLabels&gt;)</li>
<li><code>misp</code> the maximum independent set problem</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org1d2344f" class="outline-2">
<h2 id="org1d2344f"><span class="section-number-2">3.</span> The Maximum Independent Set Problem (MISP)</h2>
<div class="outline-text-2" id="text-3">
<p>
It is, perhaps, most effective to look at some models
to get a reasonable sense of the effort it takes to model and
solve a problem with <b>CODD</b>. 
</p>
</div>
<div id="outline-container-orgc9ab23d" class="outline-3">
<h3 id="orgc9ab23d"><span class="section-number-3">3.1.</span> Preamble</h3>
<div class="outline-text-3" id="text-3-1">
<p>
To start using CODD, it is sufficent to include its main header as follow
</p>
<div class="org-src-container">
<pre class="src src-c++" id="orge5379cd"><span style="color: #808080;">#include</span> <span style="color: #008000;">"codd.hpp"</span>
</pre>
</div>
</div>
</div>
