doc/CODD.html
<div id="outline-container-org4785a9c" class="outline-3">
<h3 id="org4785a9c"><span class="section-number-3">3.2.</span> Reading the instance</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-c++" id="org526e639"><span style="color: #0000FF; font-weight: bold;">struct</span> <span style="color: #6434A3;">GE</span> {
   <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">a</span>,<span style="color: #BA36A5;">b</span>;
   <span style="color: #0000FF; font-weight: bold;">friend</span> <span style="color: #6434A3;">bool</span> <span style="color: #0000FF; font-weight: bold;">operator</span><span style="color: #006699;">==</span>(<span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #6434A3;">GE</span>&amp; <span style="color: #BA36A5;">e1</span>,<span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #6434A3;">GE</span>&amp; <span style="color: #BA36A5;">e2</span>) {
      <span style="color: #0000FF; font-weight: bold;">return</span> e1.a == e2.a &amp;&amp; e1.b == e2.b;
   }
   <span style="color: #0000FF; font-weight: bold;">friend</span> <span style="color: #D0372D;">std</span>::<span style="color: #6434A3;">ostream</span>&amp; <span style="color: #0000FF; font-weight: bold;">operator</span><span style="color: #006699;">&lt;&lt;</span>(<span style="color: #D0372D;">std</span>::<span style="color: #6434A3;">ostream</span>&amp; <span style="color: #BA36A5;">os</span>,<span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #6434A3;">GE</span>&amp; <span style="color: #BA36A5;">e</span>) {
      <span style="color: #0000FF; font-weight: bold;">return</span> os  &lt;&lt; e.a &lt;&lt; <span style="color: #008000;">"--&gt;"</span> &lt;&lt; e.b;
   }
};

<span style="color: #0000FF; font-weight: bold;">struct</span> <span style="color: #6434A3;">Instance</span> {
   <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">nv</span>;
   <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">ne</span>;
   <span style="color: #D0372D;">std</span>::<span style="color: #6434A3;">vector</span>&lt;<span style="color: #6434A3;">GE</span>&gt; <span style="color: #BA36A5;">edges</span>;
   <span style="color: #6434A3;">FArray</span>&lt;GNSet&gt; <span style="color: #BA36A5;">adj</span>;
   <span style="color: #006699;">Instance</span>() : adj(0) {}
   <span style="color: #006699;">Instance</span>(<span style="color: #6434A3;">Instance</span>&amp;&amp; <span style="color: #BA36A5;">i</span>) : nv(i.nv),ne(i.ne),edges(<span style="color: #D0372D;">std</span>::move(i.edges)) {}
   <span style="color: #6434A3;">GNSet</span> <span style="color: #006699;">vertices</span>() {
      <span style="color: #0000FF; font-weight: bold;">return</span> setFrom(<span style="color: #D0372D;">std</span>::<span style="color: #D0372D;">views</span>::iota(0,nv));
   }
   <span style="color: #0000FF; font-weight: bold;">auto</span> <span style="color: #006699;">getEdges</span>() <span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #0000FF; font-weight: bold;">noexcept</span> { <span style="color: #0000FF; font-weight: bold;">return</span> edges;}
   <span style="color: #6434A3;">void</span> <span style="color: #006699;">convert</span>() {
      adj = FArray&lt;<span style="color: #6434A3;">GNSet</span>&gt;(nv+1);
      <span style="color: #0000FF; font-weight: bold;">for</span>(<span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #0000FF; font-weight: bold;">auto</span>&amp; <span style="color: #BA36A5;">e</span> : edges) {
         adj[e.a].insert(e.b);
         adj[e.b].insert(e.a);
      }         
   }
};

<span style="color: #6434A3;">Instance</span> <span style="color: #006699;">readFile</span>(<span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #6434A3;">char</span>* <span style="color: #BA36A5;">fName</span>)
{
   <span style="color: #6434A3;">Instance</span> <span style="color: #BA36A5;">i</span>;
   <span style="color: #0000FF; font-weight: bold;">using</span> <span style="color: #0000FF; font-weight: bold;">namespace</span> <span style="color: #D0372D;">std</span>;
   <span style="color: #6434A3;">ifstream</span> <span style="color: #BA36A5;">f</span>(fName);
   <span style="color: #0000FF; font-weight: bold;">while</span> (!f.eof()) {
      <span style="color: #6434A3;">char</span> <span style="color: #BA36A5;">c</span>;
      f &gt;&gt; c;
      <span style="color: #0000FF; font-weight: bold;">if</span> (f.eof()) <span style="color: #0000FF; font-weight: bold;">break</span>;
      <span style="color: #0000FF; font-weight: bold;">switch</span>(c) {
         <span style="color: #0000FF; font-weight: bold;">case</span> <span style="color: #008000;">'c'</span>: {
            <span style="color: #D0372D;">std</span>::<span style="color: #6434A3;">string</span> <span style="color: #BA36A5;">line</span>;
            <span style="color: #D0372D;">std</span>::getline(f,line);
         }<span style="color: #0000FF; font-weight: bold;">break</span>;
         <span style="color: #0000FF; font-weight: bold;">case</span> <span style="color: #008000;">'p'</span>: {
            <span style="color: #6434A3;">string</span> <span style="color: #BA36A5;">w</span>;
            f &gt;&gt; w &gt;&gt; i.nv &gt;&gt; i.ne;
         }<span style="color: #0000FF; font-weight: bold;">break</span>;
         <span style="color: #0000FF; font-weight: bold;">case</span> <span style="color: #008000;">'e'</span>: {
            <span style="color: #6434A3;">GE</span> <span style="color: #BA36A5;">edge</span>;
            f &gt;&gt; edge.a &gt;&gt; edge.b;
            edge.a--,edge.b--;      <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">make it zero-based</span>
            assert(edge.a &gt;=0);
            assert(edge.b &gt;=0);
            i.edges.push_back(edge);
         }<span style="color: #0000FF; font-weight: bold;">break</span>;
      }
   }
   f.close();
   i.convert();
   <span style="color: #0000FF; font-weight: bold;">return</span> i;
}  
</pre>
</div>

<p>
The C structure <code>GE</code> is meant to represent a <i>graph edge</i>. It inlines a friend function to print edges and an equality operator.  The C struct <code>Instance</code> is used to encapsulate
an instance of the MISP problem read from a text file. It holds the number of vertices <code>nv</code>, the number of edges <code>ne</code>, the list of <code>edges</code> and computes and holds the adjacency list <code>adj</code>. The latter is computed by the <code>convert</code> method which simply scans the edges
in <code>edges</code> and adds the endpoints in the respective sets of the adjacency vector. Note that the vertices are numbered from 0 onward (so the last vertex number is <code>nv - 1</code>). 
</p>

<p>
The <code>readFile</code>  function produces an <code>Instance</code> from a named file <code>fName</code>. Note how it shifts the vertex identifiers of edges down by 1 since the standard instances use a 1-based numbering scheme rather than a 0-based numbering scheme.
</p>
</div>
</div>
<div id="outline-container-orgf4e64b2" class="outline-3">
<h3 id="orgf4e64b2"><span class="section-number-3">3.3.</span> State definition</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-c++" id="orgc566bff">
<span style="color: #0000FF; font-weight: bold;">struct</span> <span style="color: #6434A3;">MISP</span> {
   <span style="color: #6434A3;">GNSet</span> <span style="color: #BA36A5;">sel</span>;
   <span style="color: #6434A3;">int</span>   <span style="color: #BA36A5;">n</span>;
   <span style="color: #0000FF; font-weight: bold;">friend</span> <span style="color: #D0372D;">std</span>::<span style="color: #6434A3;">ostream</span>&amp; <span style="color: #0000FF; font-weight: bold;">operator</span><span style="color: #006699;">&lt;&lt;</span>(<span style="color: #D0372D;">std</span>::<span style="color: #6434A3;">ostream</span>&amp; <span style="color: #BA36A5;">os</span>,<span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #6434A3;">MISP</span>&amp; <span style="color: #BA36A5;">m</span>) {
      <span style="color: #0000FF; font-weight: bold;">return</span> os &lt;&lt; <span style="color: #008000;">"&lt;"</span> &lt;&lt; m.sel &lt;&lt; <span style="color: #008000;">','</span> &lt;&lt; m.n &lt;&lt; <span style="color: #008000;">','</span> &lt;&lt; <span style="color: #008000;">"&gt;"</span>;
   }
};

<span style="color: #0000FF; font-weight: bold;">template</span>&lt;&gt; <span style="color: #0000FF; font-weight: bold;">struct</span> <span style="color: #D0372D;">std</span>::<span style="color: #6434A3;">equal_to</span>&lt;<span style="color: #6434A3;">MISP</span>&gt; {
   <span style="color: #6434A3;">bool</span> <span style="color: #0000FF; font-weight: bold;">operator</span><span style="color: #006699;">()</span>(<span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #6434A3;">MISP</span>&amp; <span style="color: #BA36A5;">s1</span>,<span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #6434A3;">MISP</span>&amp; <span style="color: #BA36A5;">s2</span>) <span style="color: #0000FF; font-weight: bold;">const</span> {
      <span style="color: #0000FF; font-weight: bold;">return</span> s1.n == s2.n &amp;&amp; s1.sel == s2.sel;         
   }
};

<span style="color: #0000FF; font-weight: bold;">template</span>&lt;&gt; <span style="color: #0000FF; font-weight: bold;">struct</span> <span style="color: #D0372D;">std</span>::<span style="color: #6434A3;">hash</span>&lt;<span style="color: #6434A3;">MISP</span>&gt; {
   <span style="color: #D0372D;">std</span>::<span style="color: #6434A3;">size_t</span> <span style="color: #0000FF; font-weight: bold;">operator</span><span style="color: #006699;">()</span>(<span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #6434A3;">MISP</span>&amp; <span style="color: #BA36A5;">v</span>) <span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #0000FF; font-weight: bold;">noexcept</span> {
      <span style="color: #0000FF; font-weight: bold;">return</span> <span style="color: #D0372D;">std</span>::rotl(<span style="color: #D0372D;">std</span>::<span style="color: #6434A3;">hash</span>&lt;<span style="color: #6434A3;">GNSet</span>&gt;{}(v.sel),32) ^ <span style="color: #D0372D;">std</span>::<span style="color: #6434A3;">hash</span>&lt;<span style="color: #6434A3;">int</span>&gt;{}(v.n);
   }
};
</pre>
</div>
<p>
The <code>MISP</code> struct defines the state representation for the DP model. For the <i>maximum independent set problem</i> the state is simply a set of integers named <code>sel</code> and an
integer <code>n</code> representing the index of the next vertex to consider for inclusion (or exclusion) from the independent set. The next two classe are standard C++ and define the following:
</p>
<ul class="org-ul">
<li><code>std::equal_to&lt;MISP&gt;</code>: this structure conforms to the STL and defines as equality operator over the state <code>MISP</code></li>
<li><p>
<code>sth::hash&lt;MISP&gt;</code>: this structure conforms to the STL and defines a hash function for
</p>

<p>
  the state <code>MISP</code>. Note how it uses the hash functions for the <code>int</code> type and the
<code>GNSet</code> types provided by the STL or the <code>CODD</code> library.
</p></li>
</ul>
</div>
</div>
