doc/CODD.org
*** Getting started

#+begin_src c++
  int main(int argc,char* argv[])
  {
     // using STL containers for the graph
     if (argc < 2) {
        std::cout << "usage: coloring <fname> <width>\n";
        exit(1);
     }
     const char* fName = argv[1];
     const int w = argc==3 ? atoi(argv[2]) : 64;
     auto instance = readFile(fName);

     const GNSet ns = instance.vertices();
     const int top = ns.size();
     const std::vector<GE> es = instance.getEdges();
     
     const auto labels = ns | GNSet { top };     // using a plain set for the labels
     std::vector<int> weight(ns.size()+1);
     weight[top] = 0;
     for(auto v : ns) weight[v] = 1;
     ...
#+end_src

The =main= program simply gets the filename from the command line and reads the
instance from the file. It then extract in =ns= the set of vertices, in =top= its cardinality and in =es= the list of edges. The last four lines define the =labels= to be used (the identifier of all vertices together with =top= to encode the transition to the final state in  the decision diagram). They also define the weights of the
vertices. Since the instances are cliques (from the DIMACS challenge), the =weight= of every vertex is 1 while the =weight= of =top= is 0.

*** The Bound Tracker
The maximum independent set is an optimization (maximization) problem. CODD needs to track solutions as they get produces and offers the opportunity to execute an arbitrary code fragment when a new solution somes forth. This code fragment can be used, for instance, to check the correctness of the solution. 

This task is the responsibility of the =Bounds= object. Minimally, one simply must declare an instance as follows:
#+begin_src c++
  Bounds bnds;
#+end_src

#+begin_attention
In the MISP example, we illustrate how to respond to incoming solutions. In this case the =Bounds= instance uses a C++ lambda (a closure) that will be fed a solution =inc=, i.e., a vector of labels.
#+end_attention

Consider the example below:
#+begin_src c++
     Bounds bnds([&es](const std::vector<int>& inc)  {
        bool ok = true;    
        for(const auto& e : es) {         
           bool v1In = (e.a < (int)inc.size()) ? inc[e.a] : false;
           bool v2In = (e.b < (int)inc.size()) ? inc[e.b] : false;
           if (v1In && v2In) {
              std::cout << e << " BOTH ep in inc: " << inc << "\n";
              assert(false);
           }
           ok &= !(v1In && v2In);
        }
        std::cout << "CHECKER is " << ok << "\n";
     });
#+end_src
The closure first /captures/ the set of edges (by reference) as checking the validity of a solution simply entails looping over all edges and making sure that not both endpoints of an edge are included in the solution. The =for= loop binds =e= to an edge and, provided that the endpoints are mentioned in the solution, looks up the Boolean associated to the vertex in the solution. Note how the solution =inc= can be a prefix of the full vertex list (hence the conditional expression). If both endpoints are mentionned in the solution, the computation is aborted as this would indicate a bug in the model. 

*** Defining neighbors

The main model will make use of the adjacency list, so it is advisable to hold into
a variable =neighbors= the adjacency list for the graph.
#+begin_src c++
  auto neighbors = instance.adj;
#+end_src

*** The actual CODD Model

A CODD model capture a label transition system (LTS). This LTS operates on nodes holding states for the problem. In the case of the maximum independent set, the states are =MISP= instances. The LTS starts from a /source/ node and forms paths that ultimately target a /sink/ state. A path in the LTS moves from state to state by /generating labels/ and  using a /transition/ function. Each such transition can incur a /cost/.

The CODD solver uses a branch & bound strategy with both a primal and a dual bound. Primal bounds are produced as a matter of course each time an incumbent solution is found, but also through  the used of *restricted decision diagrams*. Likewise, dual bounds are produced by *relaxed decision diagrams*. Such relaxed diagrams rely on
/merge/  operations to collapse state.

CODD models all the italicized concepts outlined in the prior paragraphs with C++ closures. The remainder of this section presents them, one at a time.

**** The Start State Closure
The root, start or source state in the MISP application simly holds in the =sel= property of the state the indices of all legal vertices and holds in =n= the value 0 to report that the next decision is to be about vertex 0.  Note how the code below
uses the STL =std::views::iota= to loop over the closed range [0,top] and insert each value =i= in the set =U=  that is then used to create and return the root state.

#+begin_src c++
  const auto myInit = [top]() {   // The root state
      GNSet U = {}; 
      for(auto i : std::views::iota(0,top))
         U.insert(i);
      return MISP { U , 0};
   };
#+end_src

