doc/CODD.html
<li><a id="orgb9d85d9"></a>The Sink State Closure<br />
<div class="outline-text-5" id="text-3-4-4-2">
<p>
The sink state is chosen, by convention, to hold an empty set for the remaining legal vertices (so no more decision beyond this point) and <code>top</code> as the next vertex to consider since top is the index of the last vertex plus 1. Note how the closure capture the <code>top</code> local variable.
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #0000FF; font-weight: bold;">auto</span> <span style="color: #BA36A5;">myTarget</span> = [<span style="color: #D0372D;">top</span>]() {    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">The sink state</span>
   <span style="color: #0000FF; font-weight: bold;">return</span> MISP { GNSet {},top};
};
</pre>
</div>
</div>
</li>
<li><a id="org5720b39"></a>The Label Generation Closure<br />
<div class="outline-text-5" id="text-3-4-4-3">
<p>
Moving from one state to the next involves making a decision about the next vertex to be consider for inclusion. Observe that the identity of that vertex is held in the <code>n</code> property of the state we are departing. The decision, in this case, is a binary choice. Either we include <code>n</code> or we do not. So the label generation function
returns the closed range [0,1] as the valid outgoing labels. Note how the closure takes as input the source state <code>s</code> (yet, for the MISP model, the source state is not used for any purposes.).
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #0000FF; font-weight: bold;">auto</span> <span style="color: #BA36A5;">lgf</span> = [](<span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #6434A3;">MISP</span>&amp; <span style="color: #BA36A5;">s</span>)  {
   <span style="color: #0000FF; font-weight: bold;">return</span> <span style="color: #D0372D;">Range</span>::close(0,1);
}; 
</pre>
</div>
</div>
</li>
<li><a id="org7f4b63e"></a>The State transition Closure<br />
<div class="outline-text-5" id="text-3-4-4-4">
<p>
the state transition closure is the heart of the model. It specifies what state to go to when leaving <code>s</code> through label <code>label</code>. Observe that <code>s</code> dictates which vertex to consider in <code>s.n</code>. Two cases arise:
</p>
<ul class="org-ul">
<li>\(s.n \geq top\) In this situation, we ran out of vertices. If the remaining legal set is empty (\(s.sel = \emptyset\)) then we ought to transition to the sink as we are closing a viable path. Otherwise, this is a "dead-end" and the code return nothing (<code>std::nullopt</code>) as the API uses the C++ optional type to convey the absence of a transition.</li>
<li>\(s.n < top\) In this situation, we can decide to include <code>s.n</code> in the MISP provided that it is still legal (i.e., provided that \(s.n \in s.sel\)).
The first line of the second case therefore commits to not transitioning whenever
\(s.n \notin s.sel \wedge label=True\) and thus return <code>std::nullopt</code>. Otherwise, <code>s.n</code> is eligible (because it is either to be excluded, or it is still legal) and the new state is computed. The new state \(out = s.sel \setminus N(s.n) \setminus \{s.n\}\) where \(N(s.n)\) refers to the neighbors of \(s.n\).  The <code>diffWith</code> method implements the set difference calculation. Finally, the result state holds <code>out</code> and sets the next vertex to consider to be \(top\) if \(out = \emptyset\) or \(s.n + 1\) otherwise.</li>
</ul>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #0000FF; font-weight: bold;">auto</span> <span style="color: #BA36A5;">myStf</span> = [<span style="color: #D0372D;">top</span>,&amp;<span style="color: #BA36A5;">neighbors</span>](<span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #6434A3;">MISP</span>&amp; <span style="color: #BA36A5;">s</span>,<span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">label</span>) -&gt; <span style="color: #D0372D;">std</span>::<span style="color: #6434A3;">optional</span>&lt;<span style="color: #6434A3;">MISP</span>&gt; {
    <span style="color: #0000FF; font-weight: bold;">if</span> (s.n &gt;= top) {
       <span style="color: #0000FF; font-weight: bold;">if</span> (s.sel.empty()) 
          <span style="color: #0000FF; font-weight: bold;">return</span> MISP { GNSet {}, top};
       <span style="color: #0000FF; font-weight: bold;">else</span> <span style="color: #0000FF; font-weight: bold;">return</span> <span style="color: #D0372D;">std</span>::nullopt;
    } <span style="color: #0000FF; font-weight: bold;">else</span> {
       <span style="color: #0000FF; font-weight: bold;">if</span> (!s.sel.contains(s.n) &amp;&amp; label) <span style="color: #0000FF; font-weight: bold;">return</span> <span style="color: #D0372D;">std</span>::nullopt; 
       <span style="color: #6434A3;">GNSet</span> <span style="color: #BA36A5;">out</span> = s.sel;
       out.remove(s.n);   <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">remove n from state</span>
       <span style="color: #0000FF; font-weight: bold;">if</span> (label) out.diffWith(neighbors[s.n]); 
       <span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #6434A3;">bool</span> <span style="color: #BA36A5;">empty</span> = out.empty();  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">find out if we are done!</span>
       <span style="color: #0000FF; font-weight: bold;">return</span> MISP { <span style="color: #D0372D;">std</span>::move(out),empty ? top : s.n + 1}; <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">build state accordingly</span>
    }
 };
</pre>
</div>
</div>
</li>
<li><a id="org6a8257f"></a>The transition Cost Closure<br />
<div class="outline-text-5" id="text-3-4-4-5">
<p>
Each transition from a state to another incurs a cost based on the source state and the label used to transition out. CODD once again relies on a closure to report this cost. In the code fragment below, note how the closure capture a reference to the <code>weight</code> vector and uses the identity of the vertex being labeled <code>s.n</code> as well as the <code>label</code> itself  (a 0/1 value) to compute and return the actual cost.
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #0000FF; font-weight: bold;">auto</span> <span style="color: #BA36A5;">scf</span> = [&amp;<span style="color: #BA36A5;">weight</span>](<span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #6434A3;">MISP</span>&amp; <span style="color: #BA36A5;">s</span>,<span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">label</span>) { <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">cost function </span>
   <span style="color: #0000FF; font-weight: bold;">return</span> label * weight[s.n];
};
</pre>
</div>
</div>
</li>
<li><a id="org46a28b3"></a>The State Merge Closure<br />
<div class="outline-text-5" id="text-3-4-4-6">
<p>
CODD computes its dual bound with a relaxation that <i>merges</i> state. The implementation uses a closure which, given two states \(s_1\) and \(s_2\) determines
whether the two states are mergeable and returns a new state if they are, or the
<code>std::nullopt</code> optional if they are not.
</p>

<p>
In the MISP case, states are always mergeable and the merge result is none other
than the union of the two eligible sets of vertices and the minimum identifier for the next vertex. In the code below the C++ operator <code>|</code> conveys the union of the
two sets.
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #0000FF; font-weight: bold;">auto</span> <span style="color: #BA36A5;">smf</span> = [](<span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #6434A3;">MISP</span>&amp; <span style="color: #BA36A5;">s1</span>,<span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #6434A3;">MISP</span>&amp; <span style="color: #BA36A5;">s2</span>) -&gt; <span style="color: #D0372D;">std</span>::<span style="color: #6434A3;">optional</span>&lt;<span style="color: #6434A3;">MISP</span>&gt; {
   <span style="color: #0000FF; font-weight: bold;">return</span> MISP {s1.sel | s2.sel,<span style="color: #D0372D;">std</span>::min(s1.n,s2.n)};
};
</pre>
</div>
</div>
</li>
<li><a id="orgced9e87"></a>Local Bound Closure<br />
<div class="outline-text-5" id="text-3-4-4-7">
<div class="caution" id="orgcc7c41b">
<p>
CODD can use an <i>optional</i> closure to quickly compute dual bounds associated to
states of the LTS. The optional <code>local</code> closure is therefore typically lightweight.
</p>

</div>
<p>
In the case of MISP, a simple dual bound consist of summing up the weight of all the vertices that are still eligible. This is clearly an overestimate as some of these vertices will be ruled out. But it's cheap to compute!
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #0000FF; font-weight: bold;">auto</span> <span style="color: #BA36A5;">local</span> = [&amp;<span style="color: #BA36A5;">weight</span>](<span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #6434A3;">MISP</span>&amp; <span style="color: #BA36A5;">s</span>) -&gt; <span style="color: #6434A3;">double</span> {
   <span style="color: #0000FF; font-weight: bold;">return</span> sum(s.sel,[&amp;<span style="color: #BA36A5;">weight</span>](<span style="color: #0000FF; font-weight: bold;">auto</span> <span style="color: #BA36A5;">v</span>) { <span style="color: #0000FF; font-weight: bold;">return</span> weight[v];});
};      
</pre>
</div>
</div>
</li>
