doc/CODD.org
**** Recognizing the Sink
CODD uses one last (mandatory) closure to establish equality to the sink. It does not rely on the equality operator as recognizing the sink may not require to test all its attributes for equality, but only a subset of them.
#+begin_src c++
  const auto eqs = [](const MISP& s) -> bool {
     return s.sel.size() == 0;
  };
#+end_src

**** Wrapping up
Now that all the mandatory (and optional) closures are defined, it only remains to
instantiate the generic solver with the closures given above and invoke it.

#+begin_hint
The type =Maximize<double>= is used to convey that this is a maximization problem
while the nested =double= type is the type used to track the objective function value and is currently always =double=. CODD supports =Minimize<double>= as well.
#+end_hint

#+begin_src c++   
  BAndB engine(DD<MISP,Maximize<double>, // to maximize
               decltype(myTarget), 
               decltype(lgf),
               decltype(myStf),
               decltype(scf),
               decltype(smf),
               decltype(eqs),
               decltype(local)
               >::makeDD(myInit,myTarget,lgf,myStf,scf,smf,eqs,labels,local),w);
  engine.search(bnds);
  return 0;
}
#+end_src


* Papers
** CODD
CODD: A Decision Diagram-based Solver for Combinatorial Optimization, [[https://www.ecai2024.eu/programme/preliminary-schedule][ECAI24]], 27TH EUROPEAN CONFERENCE ON ARTIFICIAL INTELLIGENCE, 19-24 OCTOBER 2024,Santiago de Compostela. L. Michel & W.J. van Hoeve.

* Related Systems
** DDO
[[https://github.com/xgillard/ddo][DDO]] was created by Pierre Schauss and Xavier Gillard.
It is a generic and efficient framework for MDD-based optimization written in Rust.

** Domain Independent DP
[[https://arxiv.org/abs/2401.13883][DIDP]] is the brainchild of Ryo Kuroiwa, J. Christopher Beck. It can be found [[https://didp.ai][here]] and offers
both a modeling and a solving API for dynamic programming.

** Peel & Bound
- Peel and Bound: Solving Discrete Optimization Problems with Decision Diagrams and Separation
  Thesis at Polytechnique Montréal, Accepted August 16th, 2024. Preprint available, (2024)
- Peel-and-Bound: Generating Stronger Relaxed Bounds with Multivalued Decision Diagrams
  28th International Conference on Principles and Practice of Constraint Programming (CP 2022), Volume 235, pp. 35:1-35:20, (2022) Isaac Rudich, Quentin Cappart, Louis-Martin Rousseau.
  [[https://drops.dagstuhl.de/entities/document/10.4230/LIPIcs.CP.2022.35][Peel & Bound]]

