doc/CODD.html
<li><a id="orgc3f1ce8"></a>Recognizing the Sink<br />
<div class="outline-text-5" id="text-3-4-4-8">
<p>
CODD uses one last (mandatory) closure to establish equality to the sink. It does not rely on the equality operator as recognizing the sink may not require to test all its attributes for equality, but only a subset of them.
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #0000FF; font-weight: bold;">auto</span> <span style="color: #BA36A5;">eqs</span> = [](<span style="color: #0000FF; font-weight: bold;">const</span> <span style="color: #6434A3;">MISP</span>&amp; <span style="color: #BA36A5;">s</span>) -&gt; <span style="color: #6434A3;">bool</span> {
   <span style="color: #0000FF; font-weight: bold;">return</span> s.sel.size() == 0;
};
</pre>
</div>
</div>
</li>
<li><a id="org1a5b2a6"></a>Wrapping up<br />
<div class="outline-text-5" id="text-3-4-4-9">
<p>
Now that all the mandatory (and optional) closures are defined, it only remains to
instantiate the generic solver with the closures given above and invoke it.
</p>

<div class="hint" id="orgd8e7765">
<p>
The type <code>Maximize&lt;double&gt;</code> is used to convey that this is a maximization problem
while the nested <code>double</code> type is the type used to track the objective function value and is currently always <code>double</code>. CODD supports <code>Minimize&lt;double&gt;</code> as well.
</p>

</div>

<div class="org-src-container">
<pre class="src src-c++">  <span style="color: #6434A3;">BAndB</span> <span style="color: #006699;">engine</span>(<span style="color: #D0372D;">DD</span>&lt;MISP,<span style="color: #6434A3;">Maximize</span>&lt;<span style="color: #6434A3;">double</span>&gt;, <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">to maximize</span>
               <span style="color: #0000FF; font-weight: bold;">decltype</span>(myTarget), 
               <span style="color: #0000FF; font-weight: bold;">decltype</span>(lgf),
               <span style="color: #0000FF; font-weight: bold;">decltype</span>(myStf),
               <span style="color: #0000FF; font-weight: bold;">decltype</span>(scf),
               <span style="color: #0000FF; font-weight: bold;">decltype</span>(smf),
               <span style="color: #0000FF; font-weight: bold;">decltype</span>(eqs),
               <span style="color: #0000FF; font-weight: bold;">decltype</span>(local)
               &gt;::makeDD(myInit,myTarget,lgf,myStf,scf,smf,eqs,labels,local),w);
  engine.search(bnds);
  <span style="color: #0000FF; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org6476352" class="outline-2">
<h2 id="org6476352"><span class="section-number-2">4.</span> Papers</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org9d1380f" class="outline-3">
<h3 id="org9d1380f"><span class="section-number-3">4.1.</span> CODD</h3>
<div class="outline-text-3" id="text-4-1">
<p>
CODD: A Decision Diagram-based Solver for Combinatorial Optimization, <a href="https://www.ecai2024.eu/programme/preliminary-schedule">ECAI24</a>, 27TH EUROPEAN CONFERENCE ON ARTIFICIAL INTELLIGENCE, 19-24 OCTOBER 2024,Santiago de Compostela. L. Michel &amp; W.J. van Hoeve.
</p>
</div>
</div>
</div>
<div id="outline-container-org679490b" class="outline-2">
<h2 id="org679490b"><span class="section-number-2">5.</span> Related Systems</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org92841f9" class="outline-3">
<h3 id="org92841f9"><span class="section-number-3">5.1.</span> DDO</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<a href="https://github.com/xgillard/ddo">DDO</a> was created by Pierre Schauss and Xavier Gillard.
It is a generic and efficient framework for MDD-based optimization written in Rust.
</p>
</div>
</div>
<div id="outline-container-org7b5ee8f" class="outline-3">
<h3 id="org7b5ee8f"><span class="section-number-3">5.2.</span> Domain Independent DP</h3>
<div class="outline-text-3" id="text-5-2">
<p>
<a href="https://arxiv.org/abs/2401.13883">DIDP</a> is the brainchild of Ryo Kuroiwa, J. Christopher Beck. It can be found <a href="https://didp.ai">here</a> and offers
both a modeling and a solving API for dynamic programming.
</p>
</div>
</div>
<div id="outline-container-org6a6630c" class="outline-3">
<h3 id="org6a6630c"><span class="section-number-3">5.3.</span> Peel &amp; Bound</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li>Peel and Bound: Solving Discrete Optimization Problems with Decision Diagrams and Separation
Thesis at Polytechnique Montréal, Accepted August 16th, 2024. Preprint available, (2024)</li>
<li>Peel-and-Bound: Generating Stronger Relaxed Bounds with Multivalued Decision Diagrams
28th International Conference on Principles and Practice of Constraint Programming (CP 2022), Volume 235, pp. 35:1-35:20, (2022) Isaac Rudich, Quentin Cappart, Louis-Martin Rousseau.
<a href="https://drops.dagstuhl.de/entities/document/10.4230/LIPIcs.CP.2022.35">Peel &amp; Bound</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Laurent Michel</p>
<p class="date">Created: 2024-08-19 Mon 11:58</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
